# Tap
tap "hashicorp/tap"

# Shell & Terminal
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "fzf"
brew "zoxide"

# Search & File
brew "fd"
brew "ripgrep"
brew "rename"

# Editor & Development
brew "git"
brew "gh"
brew "pinact"
brew "neovim"
brew "luarocks"
brew "mise"
brew "python"

# Data & JSON
brew "jq"

# Database
brew "mycli"
brew "pgcli"

# Infrastructure & Cloud
brew "hashicorp/tap/terraform"

# Security
brew "trufflehog"
brew "pwgen"

# System Utilities
brew "curl"

# Cask
cask "amical"
